{
  "_num_labels": 5,
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "decoder_start_token_id": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "finetuning_task": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "daya_tahan_negatif",
    "1": "daya_tahan_positif",
    "2": "harga_negatif",
    "3": "harga_positif",
    "4": "kelengkapan_negatif",
    "5": "kelengkapan_positif",
    "6": "kualitas_negatif",
    "7": "kualitas_positif",
    "8": "penampilan_negatif",
    "9": "penampilan_positif",
    "10": "pengemasan_negatif",
    "11": "pengemasan_positif",
    "12": "pengiriman_negatif",
    "13": "pengiriman_positif",
    "14": "seller_negatif",
    "15": "seller_positif"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "daya_tahan_negatif": 0,
    "daya_tahan_positif": 1,
    "harga_negatif": 2,
    "harga_positif": 3,
    "kelengkapan_negatif": 4,
    "kelengkapan_positif": 5,
    "kualitas_negatif": 6,
    "kualitas_positif": 7,
    "penampilan_negatif": 8,
    "penampilan_positif": 9,
    "pengemasan_negatif": 10,
    "pengemasan_positif": 11,
    "pengiriman_negatif": 12,
    "pengiriman_positif": 13,
    "seller_negatif": 14,
    "seller_positif": 15
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "prefix": null,
  "problem_type": "multi_label_classification",
  "pruned_heads": {},
  "task_specific_params": null,
  "tie_word_embeddings": true,
  "torchscript": false,
  "transformers_version": "5.9.0",
  "type_vocab_size": 2,
  "use_bfloat16": false,
  "use_cache": false,
  "vocab_size": 50000
}
